Управление_торговлей.ПБТ/src/Catalogs/СпособыОбеспеченияПотребностей/СпособыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6e636a63-6f2c-4a16-84b3-965cd15539fe">
  <name>СпособыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Enums/ТипыОбеспечения/ТипыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f485e195-bc3b-4230-9780-9a442f5e504c">
  <name>ТипыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="eeb8d2f7-1dd0-4f9d-a1c1-d88188440d05">
    <name>Покупка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="56907877-4a71-4f94-83ee-ffebb2c792cf">
    <name>ПроизводствоНаСтороне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3094999f-b4ff-434a-9488-c96967e7a128">
    <name>СборкаРазборка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3f519e6-910d-4466-a558-85f1888c7c3b">
    <name>Перемещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d6be2710-04a8-4559-8255-311e9ed52d22">
    <name>Производство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Catalogs/СпособыОбеспеченияПотребностей/Forms/ФормаЭлемента/Module.bsl
&Вместо("ЗаполнитьСписокВыбораТипаОбеспечения")
Функция ПБТ_ЗаполнитьСписокВыбораТипаОбеспечения()
	
	//brava 01.04.2021
	//так как у функции нет аннтонации после, то приходится заменять целиком.
	//здесь надо только добавить производство в конце.
	// в модуле подразумевалось, что производство вообще не доступно
	
	// Заполнение списка выбора доступных типов обеспечения.
	СписокВыбора = Новый СписокЗначений;
	
	// Заполняем возможные типы обеспечения в зависимости от функциональных опций.
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам") Тогда
		СписокВыбора.Добавить(Перечисления.ТипыОбеспечения.Покупка);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПеремещениеТоваров")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение")
		Тогда
		СписокВыбора.Добавить(Перечисления.ТипыОбеспечения.Перемещение);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСборкуРазборку")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаСборку") Тогда
		СписокВыбора.Добавить(Перечисления.ТипыОбеспечения.СборкаРазборка, НСтр("ru = 'Сборка'"));
	КонецЕсли;
	
	СписокВыбора.Добавить(Перечисления.ТипыОбеспечения.Производство); //brava
	
	Для НомерПереключателя = 1 По 5 Цикл
		ИмяЭлемента = "ТипОбеспечения" + НомерПереключателя;
		Элементы[ИмяЭлемента].СписокВыбора.Очистить();
		Если НомерПереключателя <= СписокВыбора.Количество() Тогда
			ЗначениеВыбора = СписокВыбора.Получить(НомерПереключателя-1);
			Элементы[ИмяЭлемента].СписокВыбора.Добавить(ЗначениеВыбора.Значение, ЗначениеВыбора.Представление);
		Иначе
			Элементы[ИмяЭлемента].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат СписокВыбора;

КонецФункции
